In [67]:
import pandas as pd
data = pd.read_csv('age_of_marriage_data.csv')
print(data.shape)
data.head()

(2567, 10)

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [68]:
data.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [69]:
(data.shape[0] - data.dropna().shape[0])/data.shape[0]

0.24737047136735488

In [70]:
data.dropna(inplace=True)

In [71]:
data.shape

(1932, 10)

In [72]:
data.profession.unique()

array(['Doctor / Healthcare Professional', 'Entrepreneurs / Business ',
       'Architect', 'Sales Professional / Marketing', 'Sportsman',
       'Banking Professional', 'Software Professional', 'HR Professional',
       'Finance Professional', 'Not Specified', 'Not working',
       'Chartered Accountant', 'Logistics and Travel Professional',
       'Defense Services', 'Team Member / Staff',
       'Managers and Senior Executives', 'Admin Professional',
       'Accounting Professional (Others)', 'Investment Professional',
       'Civil Engineer', 'Consultant / Supervisor / Team Leads',
       'Public Relations Professional', 'Training Professional (Others)',
       'Hotel & Hospitality Professional (Others)',
       'Software Professional (Others)', 'Nurse', 'Artist (Others)',
       'Non IT Engineer (Others)', 'Event Manager',
       'Marketing Professional', 'Science Professional (Others)',
       'Mechanical / Production Engineer', 'Research Assistant',
       'Electronics / Telecom Engineer', 'Teacher', 'Professor',
       'Interior Designer', 'Fashion Designer', 'Beautician',
       'Software Consultant',
       'Medical / Healthcare Professional (Others)',
       'Agent / Broker / Trader / Contractor', 'Lawyer',
       'Hardware & Networking professional', 'Web / UX Designers',
       'Pharmacist', 'Research Scholar', 'Actor',
       'Entertainment Professional', 'Student',
       'Customer Support / BPO / KPO Professional', 'Designer (Others)',
       'Media Professional', 'Physiotherapist / Occupational Therapist',
       'Merchant Naval Officer', 'VP / AVP / GM / DGM',
       'CxO / Chairman / Director / President', 'IAS / IRS / IES / IFS',
       'Writer', 'Lecturer', 'Other Airline Professional',
       'Social Worker / Volunteer / NGO', 'Jewellery Designer',
       'Company Secretary', 'Mariner', 'Chef / Sommelier / Food Critic',
       'Law Enforcement Employee (Others)', 'Hairstylist',
       'Agricultural Professional (Others)', 'Farming',
       'Landscape Architect', 'Psychologist', 'Legal Assistant',
       'Dentist', 'Surgeon', 'Legal Professional (Others)',
       'Air Hostess / Flight Attendant', 'Advertising Professional',
       'Indian Police Services [IPS]', 'Medical Transcriptionist',
       'Physician Assistant', 'Commercial Artist',
       'Veterinary Doctor / Healthcare Professional', 'Pilot / Co-Pilot'],
      dtype=object)

In [73]:
data.caste.unique()

array([' Shwetamber', ' Brahmin', ' Thakur', ' Born Again', ' Valmiki',
       ' Rajput - Lodhi', ' Bhatia', ' Billava', ' Vanniyar', ' Agri',
       ' Marthoma', ' Ahom', ' Baishnab', ' Roman Catholic', ' Lingayath',
       ' Kalita', ' Vaishnav', ' Sahu', ' Baishya', ' Memon', ' Agarwal',
       ' Panchal', ' Baidya', ' Kaibarta', ' Sindhi-Sakkhar',
       ' Viswabrahmin', ' Patel', ' Scheduled Caste (SC)', ' Kshatriya',
       ' Ramdasia', ' Khatri', ' OBC - Barber/Naayee', ' Baniya', ' Goud',
       ' Balija', ' Arora', ' Kayastha', ' Gursikh', ' Arya Vysya',
       ' Bhandari', ' Saini'], dtype=object)

In [74]:
X = data.drop(['profession','age_of_marriage','id','location'], axis =1)
y = data.age_of_marriage

In [79]:
X[X['caste'] == 'Agarwal'

1       False
2       False
3       False
4       False
5       False
        ...
2561    False
2562    False
2563    False
2564    False
2566    False
Name: caste, Length: 1932, dtype: bool

In [22]:
y

1       32.0
2       32.0
3       30.0
4       30.0
5       29.0
        ...
2561    30.0
2562    27.0
2563    31.0
2564    28.0
2566    32.0
Name: age_of_marriage, Length: 1932, dtype: float64

In [23]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [24]:
X.apply(encoder.fit_transform)

      gender  height  religion  caste  mother_tongue  country
1          1      16         2     34              6       19
2          1      16         1     14              8        5
3          0       7         1     36              8        5
4          1      14         0     13             13        5
5          1      14         1     38              8        5
...      ...     ...       ...    ...            ...      ...
2561       1      10         1     21             18        5
2562       0      12         1     36              8        5
2563       1      10         1     36              8        3
2564       0      12         1      7              2        5
2566       0      11         0     23             13        5

[1932 rows x 6 columns]

In [42]:
int(X.loc[1,'height'].split('\'')[0])*12*2.54

152.4

In [49]:
int(X.loc[1,'height'].split('\'')[1].replace('"',''))*2.54

17.78

In [52]:
def inch_to_cm(x):
    a=int(x.split('\'')[0])*12*2.54
    b=int(x.split('\'')[1].replace('"',''))*2.54
    return a+b

In [53]:
X['height'] = X['height'].apply(inch_to_cm)

In [66]:
X.head(10)

    gender  height  religion  caste  mother_tongue  country
1        1  170.18         2     34              6       19
2        1  170.18         1     14              8        5
3        0  152.40         1     36              8        5
4        1  165.10         0     13             13        5
5        1  165.10         1     38              8        5
6        0  157.48         1     28              8        5
7        1  165.10         1     11             20        5
8        0  165.10         2     34              6        5
9        0  154.94         1     12             25        5
11       1  175.26         1     14              2        5

In [ ]:
X_encoded = X.drop('height')

In [57]:
X.loc[:,['gender','religion','caste','mother_tongue','country']] = \
X.loc[:,['gender','religion','caste','mother_tongue','country']].apply(encoder.fit_transform)

In [58]:
X.head()

   gender  height  religion  caste  mother_tongue  country
1       1  170.18         2     34              6       19
2       1  170.18         1     14              8        5
3       0  152.40         1     36              8        5
4       1  165.10         0     13             13        5
5       1  165.10         1     38              8        5

In [59]:

from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [60]:
from sklearn.ensemble import RandomForestRegressor
model = RandomForestRegressor(n_estimators=80,max_depth=11)
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

## Evaluation

In [61]:
from sklearn.metrics import mean_absolute_error, r2_score
print("MAE : ", mean_absolute_error(y_test,y_predict))
r2_score(y_test,y_predict)

MAE :  1.031244203109998

0.6991693405732955

In [ ]:
model.predict([1,180,1,])


# Export model

In [65]:
from joblib import dump, load
dump(model,'marriage_age_predict_model.ml')

['marriage_age_predict_model.ml']